yeapzexin/ece4191/DC_Motor_1/Design01.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Motor_1_IN_1_aliases.h"
#include "Motor_1_IN_1.h"
#include "Motor_1_IN_2_aliases.h"
#include "Motor_1_IN_2.h"
#include "PWM_Master.h"
#include "Clock_1.h"
#include "Motor_1_ENA_aliases.h"
#include "Motor_1_ENA.h"
#include "QuadDec_1.h"
#include "Motor_1_Phase_A_aliases.h"
#include "Motor_1_Phase_A.h"
#include "Motor_1_Phase_B_aliases.h"
#include "Motor_1_Phase_B.h"
#include "UART_1.h"
#include "Motor_2_IN_3_aliases.h"
#include "Motor_2_IN_3.h"
#include "Motor_2_IN_4_aliases.h"
#include "Motor_2_IN_4.h"
#include "Motor_2_ENB_aliases.h"
#include "Motor_2_ENB.h"
#include "QuadDec_2.h"
#include "Motor_2_Phase_A_aliases.h"
#include "Motor_2_Phase_A.h"
#include "Motor_2_Phase_B_aliases.h"
#include "Motor_2_Phase_B.h"
#include "PWM_Slave.h"
#include "Clock_2.h"
#include "Timer_1.h"
#include "isr_1.h"
#include "isr_2.h"
#include "Front_Echo_1_aliases.h"
#include "Front_Echo_1.h"
#include "Front_Trigger_1_aliases.h"
#include "Front_Trigger_1.h"
#include "Clock_3.h"
#include "Timer_2.h"
#include "Timer_3.h"
#include "led_green_aliases.h"
#include "led_green.h"
#include "Right_Trigger_aliases.h"
#include "Right_Trigger.h"
#include "Right_Echo_aliases.h"
#include "Right_Echo.h"
#include "isr_3.h"
#include "Timer_4.h"
#include "IR_input_aliases.h"
#include "IR_input.h"
#include "Left_Trigger_aliases.h"
#include "Left_Trigger.h"
#include "Left_Echo_aliases.h"
#include "Left_Echo.h"
#include "isr_4.h"
#include "Timer_5.h"
#include "led_red_aliases.h"
#include "led_red.h"
#include "Front_Trigger_2_aliases.h"
#include "Front_Trigger_2.h"
#include "Front_Echo_2_aliases.h"
#include "Front_Echo_2.h"
#include "isr_5.h"
#include "PWM_ColorSensor.h"
#include "Counter_ColorSensor.h"
#include "Clock_7.h"
#include "led_blue_aliases.h"
#include "led_blue.h"
#include "isr_6.h"
#include "Control_Reg_1.h"
#include "S1_aliases.h"
#include "S1.h"
#include "S2_aliases.h"
#include "S2.h"
#include "S0_aliases.h"
#include "S0.h"
#include "S3_aliases.h"
#include "S3.h"
#include "CS_LED_aliases.h"
#include "CS_LED.h"
#include "CS_out_aliases.h"
#include "CS_out.h"
#include "PWM_SmallServo.h"
#include "Clock_4.h"
#include "PWM_BigServo.h"
#include "small_servo_aliases.h"
#include "small_servo.h"
#include "big_servo_aliases.h"
#include "big_servo.h"
#include "QuadDec_1_Cnt16.h"
#include "UART_1_IntClock.h"
#include "QuadDec_2_Cnt16.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

